Repository: voximplant/ios-kit-chat-ui-demo
Catalog: KitChatDemo(UIKit)/UI/Resources/Localizable.xcstrings
Source language: en
Languages: es, pt, ru

# allow_notifications_button_title
source: Allow notifications
es: Permitir notificaciones
pt: Permitir notificações
ru: Разрешить уведомления

# banner_error_message
source: Push token registration error
es: Error de registro de token push
pt: Erro de registro de token push
ru: Ошибка регистрации push-токена

# banner_loading_message
source: Attempt in progress...
es: Intento en curso...
pt: Tentativa em andamento...
ru: Повторение попытки…

# banner_retry_label
source: Try again
es: Inténtelo de nuevo
pt: Tentar novamente
ru: Повторить попытку

# channel_uuid_placeholder
source: Enter channel UUID
es: Introduzca UUID del canal
pt: Insira UUID do canal
ru: Введите UUID канала

# channel_uuid_title
source: Channel UUID
es: UUID del canal
pt: UUID do canal
ru: UUID канала

# client_id_placeholder
source: Enter client ID
es: Introduzca ID del cliente
pt: Insira ID do cliente
ru: Введите ID клиента

# client_id_title
source: Client ID
es: ID del cliente
pt: ID do cliente
ru: ID клиента

# error_empty_input
source: The field cannot be empty
es: El campo no puede estar vacío
pt: O campo não pode ficar vazio
ru: Поле не может быть пустым

# notifications_permission_alert_close_button
source: Close
es: Cerrar
pt: Fechar
ru: Закрыть

# notifications_permission_alert_settings_button
source: Settings
es: Configuración
pt: Configuração
ru: Настройки

# notifications_permission_alert_title
source: To receive notifications, allow permission in Settings
es: Para recibir notificaciones, permita permiso en Configuración
pt: Para receber notificações, permita permissão em Configurações
ru: Разрешите доступ к уведомлениям в настройках

# open_chat_button_title
source: Open chat
es: Abrir chat
pt: Abrir chat
ru: Открыть чат

# region_picker_cancel_button
source: Cancel
es: Cancelar
pt: Cancelar
ru: Отмена

# region_picker_select_button
source: Select
es: Seleccionar
pt: Selecionar
ru: Выбрать

# region_placeholder
source: Select region
es: Seleccionar región
pt: Selecionar região
ru: Выберите регион

# region_title
source: Region
es: Región
pt: Região
ru: Регион

# token_placeholder
source: Enter token
es: Introduzca token
pt: Insira o token
ru: Введите токен

# token_title
source: Token
ru: Токен
